# BarTypeDiameterOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BarTypeDiameterOptions Properties
BarTypeDiameterOptions Class See Also
---
The BarTypeDiameterOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BarModelDiameter | Represents the bar model diameter of the RebarBarType. |
| BarNominalDiameter | Represents the bar nominal diameter of the RebarBarType. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| StandardBendDiameter | Represents the standard bar bend diameter of the RebarBarType. |
| StandardHookBendDiameter | Represents the standard hook bend diameter of the RebarBarType. |
| StirrupTieBendDiameter | Represents the stirrup/tie bar and hook bend diameter of the RebarBarType. |

# See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace